
package jec.ac.jp.incense;

public enum ButtonEnum {

    BUTTON_1("◆大江戸香　ブランドコンセプト◆\n「雅」と「俗」の文化交流が作りあげた、遊びと洒落の江戸文化。\n四季を楽しみ、えにしを尊び、人々がいきいきと暮らしていた江戸の町。\n江戸の匂い立つような暮らしぶりを、ここ江戸は東京の香司が香りで表現。\nひとすじのけむりが、粋でモダンな江戸の世界へとご招待。\nさあさあ、江戸の香りの世界へようこそ。\n\n◆大江戸香　伽羅姫　香りの特徴◆\n江戸の憧れ。粋な女性の嗜み。深く味わいのある伽羅をイメージした香り。",
            R.drawable.senkou1, "https://www.nipponkodo.co.jp/shop/products/detail/38347?srsltid=AfmBOopMvHnlj3cjy1WhZqyen2IVS3sJ1MWXRpunJ8BS-ESnxIdQnpie"),
    BUTTON_2("古来より、各地には『神の木』といわれてきた香木があります。\n" +
            "それらは、祈りや心身や空間を浄化するために使われ、\n" +
            "古人の智慧として受け継がれてきました。\n" +
            "Chie(チエ)は、合成香料を使わず、自然の香原料と粉体のみを使い、\n" +
            "今を生きる香りとして開発されたブランドです。\n" +
            "自然とつながり、心を解放してください。\n" +
            "\n" +
            "ジンチョウゲ科ジンコウ属の木の、ダメージを受けた部分が長期間かけて樹脂化した部分を沈香と呼びます。木のぬくもりを感じるハニーのような甘さが特徴です。",
            R.drawable.senkou2, "https://www.nipponkodo.co.jp/shop/products/detail/38918?srsltid=AfmBOoqur34kLkUG1N6WBJVdCVsaI7brk2pWLEJq9VChgyweueeQ93_1"),
    BUTTON_3("豪華、絢爛な安土桃山文化。\n" +
            "この時代には、茶の湯、連歌、能楽など、人の和を意図したさまざまな寄り合いが行われました。\n" +
            "香道もその一つで香木がおおいに用いられ、人の心を和ませるものとして貴重なものでした。\n" +
            "こまかに装飾をほどこした豪華な香道具も、今に残されております。\n" +
            "\n" +
            "伽羅桃山は入手の難しい甘みのあるベトナム産の沈香を豊富に用いた、華やかな桃山の時代にふさわしい香りです。\n",
            R.drawable.senkou3, "https://www.nipponkodo.co.jp/shop/products/detail/38642"),
    BUTTON_4("豪華、絢爛な安土桃山文化。\n" +
            "この時代には、茶の湯、連歌、能楽など、人の和を意図したさまざまな寄り合いが行われました。\n" +
            "香道もその一つで香木がおおいに用いられ、人の心を和ませるものとして貴重なものでした。\n" +
            "こまかに装飾をほどこした豪華な香道具も、今に残されております。\n" +
            "\n" +
            "伽羅桃山は入手の難しい甘みのあるベトナム産の沈香を豊富に用いた、華やかな桃山の時代にふさわしい香りです。",
            R.drawable.senkou4, "https://www.nipponkodo.co.jp/shop/products/detail/38246"),
    BUTTON_5("貴重な香木・沈香(じんこう)を用いた「沈香寿山」です。さっぱりとした味わいの沈香をはじめ、白檀・生薬系香料を豊富に使用しています。天然素材の香りの活きたきりりと深い香りです。穏やかにお部屋に香りが広がります。",
            R.drawable.senkou5, "https://www.nipponkodo.co.jp/shop/products/detail/36591"),
    BUTTON_6("貴重な香木・沈香(じんこう)を用いた「沈香寿山」です。さっぱりとした味わいの沈香をはじめ、白檀・生薬系香料を豊富に使用しています。\n" +
            "天然素材の香りの活きたきりりと深い香りです。穏やかにお部屋に香りが広がります。\n" +
            "\n" +
            "お香サイズ：約57mm\n" +
            "1箱サイズ：高さ68mm×幅100mm×奥行24mm\n" +
            "箱含む重量：約68g\n" +
            "燃焼時間：約13分\n" +
            "主原料：タブ粉、香料",
            R.drawable.senkou6, "https://www.nipponkodo.co.jp/shop/products/detail/36590"),
    BUTTON_7("甘みのある華やかな味わいの沈香・伽羅を豊富に用い、白檀・生薬系香料を調合しております。優雅で重厚感のある香りです。穏やかにお部屋に香りが漂います。\n" +
            "\n" +
            "金色の紐をほどいて包みを開くとコーン型のお香と簡易香立、そして香りの特徴やお香の焚き方を記した能書が入っています。\n" +
            "お香は小袋入り。\n" +
            "お香を焚く際は、簡易香立にお香をのせ、さらに灰を受けるに\n" +
            "十分な大きさの不燃性のお皿を下に敷いてお使いください。\n" +
            "\n" +
            "お香サイズ：径約9mm×高約20mm\n" +
            "1箱サイズ：高さ153mm×幅85mm×奥行30mm\n" +
            "箱含む重量：約69g\n" +
            "燃焼時間：約12分\n" +
            "主原料：タブ粉、香料",
            R.drawable.senkou7, "https://www.nipponkodo.co.jp/shop/products/detail/36585"),
    BUTTON_8("日本の小京都ともいわれる兵庫県出石にある福住。\n" +
            "ブランド創業者が幼少期を過ごした日本海からほど近い、山間の豊かな自然に囲まれた思い出の地。\n" +
            "地名の由来は「幸福が宿る場所」とも言われており、古来より幸福を運ぶ鳥とされていたコウノトリの生息地でもありました。日本のコウノトリは1964年に一度絶滅しましたが、中国をはじめ国際協力によって孵化に成功し、現在では少しづつ生息数が増え、出石周辺には時おりその姿を見かけるようになりました。\n" +
            "\n" +
            "宿場町の面影を残し、伝統建築物が立ち並ぶ街並み。この地に想いを馳せ、「幸福が宿る香り」を創香したいという想いを込めたブランドです。\n" +
            "\n" +
            "【香り】\n" +
            "純粋さの象徴と言われる白玉蘭の香りのお香です。",
            R.drawable.senkou8, "https://www.nipponkodo.co.jp/shop/products/detail/38881"),
    BUTTON_9("日本の小京都ともいわれる兵庫県出石にある福住。\n" +
            "ブランド創業者が幼少期を過ごした日本海からほど近い、山間の豊かな自然に囲まれた思い出の地。\n" +
            "地名の由来は「幸福が宿る場所」とも言われており、古来より幸福を運ぶ鳥とされていたコウノトリの生息地でもありました。日本のコウノトリは1964年に一度絶滅しましたが、中国をはじめ国際協力によって孵化に成功し、現在では少しづつ生息数が増え、出石周辺には時おりその姿を見かけるようになりました。\n" +
            "\n" +
            "宿場町の面影を残し、伝統建築物が立ち並ぶ街並み。この地に想いを馳せ、「幸福が宿る香り」を創香したいという想いを込めたブランドです。\n" +
            "\n" +
            "【香り】\n" +
            "癒しに良いと言われるラベンダーの香りのお香です。",
            R.drawable.senkou9, "https://www.nipponkodo.co.jp/shop/products/detail/38878");

    private final String text;
    private final int imageResId;
    private final String url;

    // 构造函数
    ButtonEnum(String text, int imageResId, String url) {
        this.text = text;
        this.imageResId = imageResId;
        this.url = url;
    }

    // 获取文本内容
    public String getText() {
        return text;
    }

    // 获取图片资源 ID
    public int getImageResId() {
        return imageResId;
    }

    // 获取链接
    public String getUrl() {
        return url;
    }
}

